IDENTIFICATION DIVISION.
PROGRAM-ID.     SAMPDUMP.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. IBM-ISERIES.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
FD  FILE-1.
01  RECORD-1.
05 R-TYPE             PIC X(1).
05 R-AREA-CODE        PIC 9(2).
88 R-NORTH-EAST VALUES 15 THROUGH 30.
05 R-SALES-CAT-1      PIC S9(5)V9(2) COMP-3.
05 R-SALES-CAT-2      PIC S9(5)V9(2) COMP-3.
05 FILLER             PIC X(1).

WORKING-STORAGE SECTION.
01  W-SALES-VALUES.
05 W-CAT-1          PIC S9(8)V9(2).
05 W-CAT-2          PIC S9(8)V9(2).
05 W-TOTAL          PIC S9(8)V9(2).
01 ALPHACODE.
05 STORECODE PIC XX OCCURS 20 TIMES indexed by PMIND.

01  W-EDIT-VALUES.
05 FILLER           PIC X(8) VALUE "TOTALS: ".
05 W-EDIT-1         PIC Z(7)9.9(2)-.
05 FILLER           PIC X(3) VALUE SPACES.
05 W-EDIT-2         PIC Z(7)9.9(2)-.
05 FILLER           PIC X(3) VALUE SPACES.
05 W-EDIT-TOTAL     PIC Z(7)9.9(2)-.

01  END-FLAG            PIC X(1) VALUE SPACE.
88 END-OF-INPUT VALUE "Y".

PROCEDURE DIVISION.
MAIN-PROGRAM SECTION.
MAINLINE.
****************************************************************
* OPEN THE INPUT FILE AND CLEAR TOTALS.                        *
****************************************************************
OPEN INPUT FILE-1.
MOVE ZEROS TO W-SALES-VALUES.

****************************************************************
* READ THE INPUT FILE PROCESSING ONLY THOSE RECORDS FOR THE    *
* NORTH EAST AREA. WHEN END-OF-INPUT REACHED, SET THE FLAG     *
****************************************************************
PERFORM UNTIL END-OF-INPUT
READ FILE-1
AT END SET END-OF-INPUT TO TRUE
END-READ
IF R-NORTH-EAST AND NOT END-OF-INPUT THEN
ADD R-SALES-CAT-1 TO W-CAT-1, W-TOTAL
ADD R-SALES-CAT-2 TO W-CAT-2, W-TOTAL
END-IF
END-PERFORM.
SET PMIND to 5.
MOVE 'Z1' TO STORECODE(PMIND).
006100
006200****************************************************************
006300* DISPLAY THE RESULTS AND END THE PROGRAM.                     *
006400****************************************************************
MOVE W-CAT-1 TO W-EDIT-1.
MOVE W-CAT-2 TO W-EDIT-2.
MOVE W-TOTAL TO W-EDIT-TOTAL.
DISPLAY W-EDIT-VALUES.
STOP RUN